Meekdai/lv_micropython-actions/boards/km17/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "km17"
#define MICROPY_HW_MCU_NAME "ESP32-S2-WROVER"

#define MICROPY_PY_BLUETOOTH                (0)
#define MICROPY_HW_ENABLE_SDCARD            (0)

#define MICROPY_HW_I2C0_SCL (9)
#define MICROPY_HW_I2C0_SDA (8)

#define MICROPY_HW_SPI1_MOSI (35)
#define MICROPY_HW_SPI1_MISO (36)
#define MICROPY_HW_SPI1_SCK (37)

#define CONFIG_IDF_TARGET_ESP32S2 (1)
